# Pandas

In [3]:
import numpy as np
import pandas as pd

In [27]:
df = pd.DataFrame(np.arange(0,12).reshape(4,3), index=["row1", "row2", "row3", "row4"], columns=["column1", "colum2", "column3"])

In [28]:
df

      column1  colum2  column3
row1        0       1        2
row2        3       4        5
row3        6       7        8
row4        9      10       11

In [29]:
df.to_csv('Test.csv')

In [30]:
# accessing the elements
## 1- .loc, 2- .iloc

df.loc['row1']

column1    0
colum2     1
column3    2
Name: row1, dtype: int32

In [31]:
type(df.loc['row1'])

pandas.core.series.Series

In [32]:
df.iloc[1:3, 1:]

      colum2  column3
row2       4        5
row3       7        8

In [33]:
type(df.iloc[1:3, 1:])

pandas.core.frame.DataFrame

In [ ]:
df.iloc[1:3, 1:].values

In [40]:
df.describe()

        column1     colum2    column3
count  4.000000   4.000000   4.000000
mean   4.500000   5.500000   6.500000
std    3.872983   3.872983   3.872983
min    0.000000   1.000000   2.000000
25%    2.250000   3.250000   4.250000
50%    4.500000   5.500000   6.500000
75%    6.750000   7.750000   8.750000
max    9.000000  10.000000  11.000000

In [17]:
df= pd.read_csv('Test.csv')

In [25]:
df.index_col=None

In [32]:
df

  Unnamed: 0  column1  colum2  column3 unnamed:0 unnamed
0       row1        0       1        2      None    None
1       row2        3       4        5      None    None
2       row3        6       7        8      None    None
3       row4        9      10       11      None    None

In [37]:
df.isnull().sum()

Unnamed: 0    0
column1       0
colum2        0
column3       0
unnamed:0     4
unnamed       4
dtype: int64

In [42]:
df.isnull().sum().value_counts()

0    3
Name: count, dtype: int64

In [43]:
df['column3'].value_counts()

column3
2     1
5     1
8     1
11    1
Name: count, dtype: int64

In [48]:
df.columns

Index(['Unnamed: 0', 'column1', 'colum2', 'column3', 'unnamed:0', 'unnamed'], dtype='object')

In [49]:
df.drop(['Unnamed: 0', 'unnamed:0', 'unnamed'], axis=1)

   column1  colum2  column3
0        0       1        2
1        3       4        5
2        6       7        8
3        9      10       11

In [51]:
df.rename(df['column1'], inplace=True)

In [52]:
df

  Unnamed: 0  column1  colum2  column3 unnamed:0 unnamed
0       row1        0       1        2      None    None
3       row2        3       4        5      None    None
6       row3        6       7        8      None    None
9       row4        9      10       11      None    None